{
    "pageTextData": [
        {
            "title": "Coca Cola Great Britain",
            "subTitle": "Founded in 1886 by Dr John S Pemberton",
            "description": "The Coca Cola Company is the world's leading manufacturer, marketer and distributor of non-alcoholic beverage concentrates and syrups, and produces nearly 400 brands."
        },
        {
            "title": "Coca Cola",
            "subTitle": "New York Harbour, 1886",
            "description": "It was 1886, John Pemberton, an Atlanta pharmacist, was inspired by simple curiosity. One afternoon, he stirred up a fragrant, caramel-coloured liquid and, when it was done, the mixture was combined with carbonated water and sampled by customers who all agreed - this new drink was something special!"
        },
        {
            "title": "Sprite",
            "subTitle": "West Germany, 1959",
            "description": "First introduced in 1961, crisp, refreshing, clean-tasting Sprite is now the world's leading lemon and lime flavoured soft drink and is sold in more than 190 different countries. Sprite Zero, part of our no sugar Zero range, offers the delicious lemon lime taste of Sprite without the sugar or calories."
        },
        {
            "title": "Dr Pepper",
            "subTitle": "Texas, 1885",
            "description": "Dr Pepper's unique, sparkling blend of 23 fruit flavours has been around for well over a century and it's still the same, with that distinctive flavour you just can't quite put your tongue on. It was created by Texas pharmacist Charles Alderton in 1885."
        },
        {
            "x3dModelTitle": "Coca Cola X3D Model",
            "x3dCreationMethod": "This X3D model of the coke can has been created in 3ds Max, exported to VRML97 and converted, using the instantreality transcoders, to X3D for display online.",
            "title": "History of Coca Cola",
            "subTitle": "Atlanta Beginnings",
            "description": "It was 1886, and in New York Harbour, workers were constructing the Statue of Liberty. Eight hundred miles away, another great American symbol was about to be unveiled. Like many people who change history, John Pemberton, an Atlanta pharmacist, was inspired by simple curiosity. One afternoon, he stirred up a fragrant, caramel-coloured liquid and, when it was done, he carried it a few doors down to Jacobs' Pharmacy. Here, the mixture was combined with carbonated water and sampled by customers who all agreed - this new drink was something special. So Jacobs' Pharmacy put it on sale for five cents (about 3p) a glass."
        },
        {
            "x3dModelTitle": "Sprite X3D Model",
            "x3dCreationMethod": "This X3D model of the sprite bottle has been created in 3ds Max, exported to VRML97 and converted, using the instantreality transcoders, to X3D for display online.",
            "title": "Sprite — Fanta Klare Zitrone",
            "subTitle": "First introduced in 1961",
            "description": "Crisp, refreshing, clean-tasting Sprite is now the world's leading lemon and lime flavoured soft drink and is sold in more than 190 different countries. Sprite Zero, part of Coca Cola's no sugar Zero range, offers the delicious lemon lime taste of Sprite without the sugar or calories."
        },
        {
            "x3dModelTitle": "Dr Pepper X3D Model",
            "x3dCreationMethod": "This X3D model of the pepper cup has been created in 3ds Max, exported to VRML97 and converted, using the instantreality transcoders, to X3D for display online.",
            "title": "Dr Pepper — Liquid Sunshine",
            "subTitle": "23 fruit flavours",
            "description": "Dr Pepper's unique, sparkling blend of 23 fruit flavours has been around for well over a century and it's still the same, with that distinctive flavour you just can't quite put your tongue on. It was created by Texas pharmacist Charles Alderton in 1885. He gave a sample of the first ever batch to Wade Morrison, a local shop owner, and Mr Morrison instantly agreed to stock the drink. The distinctive, bold taste of Dr Pepper has been popular ever since."
        },
        {
            "galleryTitle": "3D Images",
            "galleryDescription": "These 3D images of the Coke can, Sprite bottle and Dr Pepper cup are rendered in 3ds Max 2017 with Mental Ray."
        },
        {
            "cameraTitle": "Camera Views",
            "cameraSubtitle": "These buttons select a limited range of X3D model viewpoints, use the dropdown menu for more camera views."
        },
        {
            "animationTitle": "Animation Options",
            "animationSubtitle": "These buttons select a range of X3D animation options."
        },
        {
            "renderTitle": "Render and Lighting Options",
            "renderSubtitle": "These buttons select a limited number of render and lighting options; use the dropdown menus for more options."
        },
        {
            "about_page_title": "About Coca Cola",
            "about_page_desc": "Welcome to the immersive world of Coca-Cola! At Coca-Cola's official website, we invite you to embark on a captivating journey that celebrates the iconic brand and its rich history. Our website brings together the magic of Coca-Cola with cutting-edge technology, offering you a unique 3D experience like no other. At Coca-Cola, we believe in the power of refreshment, connection, and joy. For over a century, we have been quenching the thirst of millions with our iconic beverages, spreading happiness and bringing people together in every sip. Our commitment to quality, innovation, and sustainability has made us one of the most recognized and beloved brands worldwide. The Coca-Cola website is a testament to our dedication to creating memorable experiences for our consumers. Through our state-of-the-art 3D mode, we invite you to explore the world of Coca-Cola like never before. Immerse yourself in a virtual environment where you can interact with our products, delve into their fascinating stories, and discover the incredible impact Coca-Cola has had on pop culture, sports, and communities around the globe. Whether you're a long-time fan or new to the Coca-Cola family, our website aims to be a source of inspiration, information, and entertainment. Discover the timeless charm of our classic beverages, get a glimpse into our latest innovations, and stay up to date with the exciting campaigns and initiatives we are involved in. With engaging visuals, captivating narratives, and interactive features, we strive to create an online experience that truly reflects the spirit of Coca-Cola. But Coca-Cola is more than just a beverage company. We are committed to making a positive difference in the world. Through our sustainability initiatives, we aim to reduce our environmental footprint, promote recycling, and contribute to building a more sustainable future. We believe in fostering diversity, inclusivity, and empowerment in the communities we serve, working towards a world where everyone has the opportunity to thrive. At Coca-Cola, we are proud of our heritage, inspired by our consumers, and driven by our passion to make a difference. We invite you to join us on this extraordinary journey, exploring the history, innovation, and joy that define our brand. Raise a glass, immerse yourself in the 3D magic, and celebrate the moments that make life refreshing with Coca-Cola. Cheers to happiness, connection, and the power of a shared experience. Welcome to the world of Coca-Cola!"
        }
    ],
    "pageButtonData": [
        {
            "home": "Home",
            "about": "About",
            "models": "Models",
            "contact": "Contact",
            "more": "Find out more..."
        }
    ],
    "pageImageData": [
        {
            "cokeImg": "assets/images/site_images/coca_cola.jpg",
            "spriteImg": "assets/images/site_images/sprite.jpg",
            "pepperImg": "assets/images/site_images/dr_pepper.jpg"
        }
    ],
    "x3dUrlPath": [
        {
            "cokeUrl": "assets/x3d/coke.x3d",
            "spriteUrl": "assets/x3d/sprite.x3d",
            "pepperUrl": "assets/x3d/dr_pepper_animation.x3d"
        }
    ]
}