{
    "pageTextData": [
        {
            "title": "Coca Cola Great Britain",
            "subTitle": "Founded in 1886 by Dr John S Pemberton",
            "description": "The Coca Cola Company is the world's leading manufacturer, marketer and distributor of non-alcoholic beverage concentrates and syrups, and produces nearly 400 brands."
        },
        {
            "title": "Coca Cola",
            "subTitle": "New York Harbour, 1886",
            "description": "It was 1886, John Pemberton, an Atlanta pharmacist, was inspired by simple curiosity. One afternoon, he stirred up a fragrant, caramel-coloured liquid and, when it was done, the mixture was combined with carbonated water and sampled by customers who all agreed - this new drink was something special!"
        },
        {
            "title": "Sprite",
            "subTitle": "West Germany, 1959",
            "description": "First introduced in 1961, crisp, refreshing, clean-tasting Sprite is now the world's leading lemon and lime flavoured soft drink and is sold in more than 190 different countries. Sprite Zero, part of our no sugar Zero range, offers the delicious lemon lime taste of Sprite without the sugar or calories."
        },
        {
            "title": "Dr Pepper",
            "subTitle": "Texas, 1885",
            "description": "Dr Pepper's unique, sparkling blend of 23 fruit flavours has been around for well over a century and it's still the same, with that distinctive flavour you just can't quite put your tongue on. It was created by Texas pharmacist Charles Alderton in 1885."
        },
        {
            "x3dModelTitle": "Coca Cola X3D Model",
            "x3dCreationMethod": "This X3D model of the coke can has been created in 3ds Max, exported to VRML97 and converted to X3D for display online.",
            "title": "History of Coca Cola",
            "subTitle": "Atlanta Beginnings",
            "description": "It was 1886, and in New York Harbour, workers were constructing the Statue of Liberty. Eight hundred miles away, another great American symbol was about to be unveiled. Like many people who change history, John Pemberton, an Atlanta pharmacist, was inspired by simple curiosity. One afternoon, he stirred up a fragrant, caramel-coloured liquid and, when it was done, he carried it a few doors down to Jacobs' Pharmacy. Here, the mixture was combined with carbonated water and sampled by customers who all agreed - this new drink was something special. So Jacobs' Pharmacy put it on sale for five cents (about 3p) a glass."
        },
        {
            "x3dModelTitle": "Sprite X3D Model",
            "x3dCreationMethod": "This X3D model of the sprite bottle has been created in 3ds Max, exported to VRML97 and converted to X3D for display online.",
            "title": "Sprite — Fanta Klare Zitrone",
            "subTitle": "First introduced in 1961",
            "description": "Crisp, refreshing, clean-tasting Sprite is now the world's leading lemon and lime flavoured soft drink and is sold in more than 190 different countries. Sprite Zero, part of Coca Cola's no sugar Zero range, offers the delicious lemon lime taste of Sprite without the sugar or calories."
        },
        {
            "x3dModelTitle": "Dr Pepper X3D Model",
            "x3dCreationMethod": "This X3D model of the pepper cup has been created in 3ds Max, exported to VRML97 and converted to X3D for display online.",
            "title": "Dr Pepper — Liquid Sunshine",
            "subTitle": "23 fruit flavours",
            "description": "Dr Pepper's unique, sparkling blend of 23 fruit flavours has been around for well over a century and it's still the same, with that distinctive flavour you just can't quite put your tongue on. It was created by Texas pharmacist Charles Alderton in 1885. He gave a sample of the first ever batch to Wade Morrison, a local shop owner, and Mr Morrison instantly agreed to stock the drink. The distinctive, bold taste of Dr Pepper has been popular ever since."
        },
        {
            "galleryTitle": "3D Images",
            "galleryDescription": "These images of the Coke, Sprite, Fanta and Dr Pepper are thumbnails images utilizing fancybox."
        },
        {
            "cameraTitle": "Camera Views",
            "cameraSubtitle": "These buttons select a limited range of X3D model viewpoints, use the dropdown menu for more camera views."
        },
        {
            "animationTitle": "Animation Options",
            "animationSubtitle": "These buttons select a range of X3D animation options."
        },
        {
            "renderTitle": "Render and Lighting Options",
            "renderSubtitle": "These buttons select a limited number of render and lighting options; use the dropdown menus for more options."
        },
        {
            "about_page_title": "About Coca Cola",
            "about_page_desc": "Welcome to my exciting world of the Coca-Cola Branded 3D Website! I have created a dynamic and immersive online experience that brings the iconic Coca-Cola brand to life using HTML5, CSS3, X3D (X3DOM), JavaScript, AJAX, JSON, PHP, and following the MVC design pattern.<br><br>Using HTML5, CSS3, and X3D (X3DOM), I have built a visually stunning and interactive 3D environment where users can explore the world of Coca-Cola. With the help of JavaScript and jQuery, I have implemented various features and functionalities to enhance user interaction and create a seamless browsing experience. The use of a JavaScript frontend framework like Bootstrap 4 ensures responsiveness and a consistent layout across different devices.<br><br>To provide real-time updates and enhance user engagement, I have leveraged AJAX for asynchronous content updates. This allows for smooth and dynamic loading of HTML contents, ensuring a seamless browsing experience. Additionally, JSON has been utilized for efficient data transfer from the backend to the frontend, enabling fast and reliable communication between different components of the website.<br><br>PHP, along with a SQLite database, has been employed to manage data and facilitate seamless access to information. This combination ensures efficient retrieval and storage of data, enabling smooth navigation through the website and providing users with the most up-to-date content.<br><br>I have structured the project following the MVC (Model-View-Controller) design pattern, ensuring a clear separation of concerns and maintainability of the codebase. This design pattern allows for easy scalability, future enhancements, and collaboration among team members.<br><br>To check out the codebase and explore the 3D models used in the Coca-Cola Branded 3D Website, please visit my GitHub repository at <a href='https://github.com/oy3/3dapp/'  target='_blank'>GitHub Repository Link</a>. You will find the source code, assets, and documentation necessary to understand and further develop the project.<br><br>I am thrilled to share this immersive experience with you and invite you to dive into the captivating world of Coca-Cola through my Coca-Cola Branded 3D Website. Enjoy the visual splendor, interact with the 3D models, and discover the rich history and joy that the Coca-Cola brand has brought to people all around the globe."
          }
    ],
    "pageButtonData": [
        {
            "home": "Home",
            "about": "About",
            "models": "Models",
            "contact": "Contact",
            "more": "Find out more..."
        }
    ],
    "pageImageData": [
        {
            "cokeImg": "assets/images/site_images/coca_cola.jpg",
            "spriteImg": "assets/images/site_images/sprite.jpg",
            "pepperImg": "assets/images/site_images/dr_pepper.jpg"
        }
    ],
    "x3dUrlPath": [
        {
            "cokeUrl": "assets/x3d/coke.x3d",
            "spriteUrl": "assets/x3d/sprite.x3d",
            "pepperUrl": "assets/x3d/dr_pepper.x3d"
        }
    ]
}